---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
SATImportOptions Constructor
SATImportOptions Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | SATImportOptions()()()() | Constructs a new instance of SATImportOptions with default values of all properties. |
|  | SATImportOptions(SATImportOptions) | Constructs a new instance of SATImportOptions as a copy of the import options. |

# See Also

SATImportOptions Class

SATImportOptions Members

Autodesk.Revit.DB Namespace